Revit 2024 API
BuiltInFailures.RoomFailures.InvisibleRoomBoundElemement Property
 [Room] Bounding element is invisible in current view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvisibleRoomBoundElemement { get; }
Visual Basic
Public Shared ReadOnly Property InvisibleRoomBoundElemement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvisibleRoomBoundElemement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace